---
kind: other
id: Properties.T:Autodesk.Revit.DB.CurveNode
source: html/b8e68795-a4cf-d1af-1f72-3dc7597ce1cf.htm
---
# CurveNode Properties

Specifies whether the .NET object represents a valid Revit entity.